/***********************************
  判定
************************************/
void isJudge() {
  //不正解表示
  if( isBatu ) { 
    tCnt++;
    image( batu, 40, 40 );
    if( tCnt >= 60 ) {
      myString = "0";
      state    = 1; //待機状態へ
      tCnt     = 0;
      isBatu  = false;
    }
  }
  if( isMaru ) { //正解表示
    tCnt++; 
    image( maru, 100, 100 );
    if( tCnt >= 60 ) {
      tCnt    = 0;
      isMaru = false; 
    }
  }
}

/****************************************************************/
/* EOF                                                          */
/****************************************************************/
