/************************************************/
/* シリアルバッファを読み込み                     */
/************************************************/
void serialEvent( Serial myPort ) {
    // シリアルバッファを読込み
    String tmp; 
    // Arduinoから何かデータが送られてくるのを待つ
    tmp = myPort.readStringUntil('\n'); 
    
    // データが来た
    if( tmp != null ) { 
        state    = 3;
        myString = tmp;
        
        player.pause();   
        loadMusic();
        hayaoshi.rewind();
        hayaoshi.play();  //再生
    }
}

/****************************************************************/
/* EOF                                                          */
/****************************************************************/
