/*********************************************************************************/
/* 7セグメントLED表示          Ver.1.00β        created　by J2　イントロ班      */
/*********************************************************************************/

/******************************************************/
/* グローバル関数                                     */
/******************************************************
/*****************************************/
/* ボタンポート定義                      */
/*****************************************/
  int buttonPin1 = 40; 
  int buttonPin2 = 41;
/******************************************/
/* フラグ関連                             */
/******************************************/
  int flg1=0, flg2=0;

/********************************/
/* 初期化                       */
/********************************/
void setup(){
  //2～9番ピン　デジタル出力へセット
/*  for( int i = 2; i <= 9; ++i ) {
      pinMode(i,OUTPUT);
  }*/

  pinMode(buttonPin1, INPUT_PULLUP);
  pinMode(buttonPin2, INPUT_PULLUP);

    // 9600bpsでシリアルポートを開始
  Serial.begin(9600);
  
}

/********************************/
/* LEDレイアウト定義            */
/* 0,1,2,3,4,5,6,7,8,9,0,.      */
/********************************/
/*boolean Num_Array[11][8]={
  {0,0,0,1,0,0,0,1},{1,1,0,1,0,1,1,1},{0,0,1,1,0,0,1,0},{1,0,0,1,0,0,1,0},
  {1,1,0,1,0,1,0,0},{1,0,0,1,1,0,0,0},{0,0,0,1,1,0,0,0},{1,1,0,1,0,0,0,1},
  {0,0,0,1,0,0,0,0},{1,0,0,1,0,0,0,0},{1,1,1,0,1,1,1,1}
};
/*boolean Num_Array[11][8] = {
  {0,0,0,1,1,0,0,0},{1,1,0,1,1,1,1,0},{0,0,1,1,0,1,0,0},{1,0,0,1,0,1,0,0},
  {1,1,0,1,0,0,1,0},{1,0,0,1,0,0,0,1},{0,0,0,1,0,0,0,1},{1,1,0,1,1,0,0,0},
  {0,0,0,1,0,0,0,0},{1,0,0,1,0,0,0,0},{1,1,1,0,1,1,1,1}
};*/


/*********************************/
/* LED表示関数                   */
/*********************************/
/*void NumPrint(int Number){
  
  for (int w=0; w<=7; w++){
  digitalWrite(w+1,Num_Array[Number][w]);
  }
}

/*************************************/
/* ループ                            */
/*************************************/
void loop() {
  
    if( flg1==0 && flg2==0  ) {
        if( digitalRead( buttonPin1 ) == LOW ) { flg1 = 1; Serial.println("1"); }
        else if( digitalRead( buttonPin2 ) == LOW ){ flg2 = 1; Serial.println("2"); }
        //else if( digitalRead( buttonPin3 ) == HIGH ) { flg3 = 1; Serial.println("3"); }
        //else if( digitalRead( buttonPin4 ) == HIGH ) { flg4 = 1; Serial.println("4"); }
        //else if( digitalRead( buttonPin5 ) == HIGH ) { flg5 = 1; Serial.println("5"); }
        //else if( digitalRead( buttonPin6 ) == HIGH ) { flg6 = 1; Serial.println("6"); }
      
    } else {
        if( Serial.read() == 100 ) { 
            flg1 = flg2 = 0;
         }
    }
    
    //if( flg1 == 1 ) NumPrint(1);
    //else if( flg2 == 1 ) NumPrint(2);
    //else if( flg3 == 1 ) NumPrint(3);
    //else if( flg4 == 1 ) NumPrint(4);
    //else if( flg5 == 1 ) NumPrint(5);
    //else if( flg6 == 1 ) NumPrint(6);
    //else NumPrint( 0 );
  
}


/*******************************************/
/* End of File                             */
/*******************************************/
